Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/reference/worksheets/worksheet_one_parent_family_payment_and_income_from_work.html.txt.tmx
Source language: en
Languages: ga

source: Worksheet: One-Parent Family Payment and income from work
ga: Bileog Oibre: Íocaíocht do Theaghlach Aon-Tuismitheora agus ioncam ó obair

source: If you are getting a One-Parent Family Payment (OPF) this worksheet will help you to work out how taking up a job will affect your weekly income
ga: Is é an aidhm atá leis an mbileog oibre seo ná cabhrú leat, má tá tú ag fáil Íocaíocht do Theaghlach Aon-Tuismitheora (OPF), oibriú amach cén tionchar a bhéas ag jab ar d'ioncam seachtainiúil

source: Step 1: Find how income from work will affect your One-Parent Family Payment
ga: Céim 1: Faigh amach conas mar a chuirfidh ioncam ó obair isteach ar d'Íocaíocht do Theaghlach Aon-Tuismitheora

source: Find your assessable income from work (see Note 1) €_______
ga: Faigh d' ioncam inmheasúnaithe ón obair - féach Nóta 1 _______

source: Take away €110 from your weekly earnings (if earnings are below €110 you will keep your full OFP)
ga: Tóg €90 ón méid a shaothraíonn tú sa tseachtain (má tá an méid a shaothraíonn tú níos ísle ná €90 coinneoidh tú do OFP iomlán)

source: Half of your weekly earnings between €110 and €425 is assessed as income
ga: Measúnaítear leath den méid a shaothraíonn tú sa tseachtain idir €90 agus €425 mar ioncam

source: New rate of One-Parent Family Payment €_______
ga: Ráta Nua den Íocaíocht do Theaghlach Aon-Tuismitheora _______

source: To find your new rate of OPF check SW 19 Social Welfare Rates of Payment booklet to find out how much OPF is payable with your means
ga: Chun do ráta nua OPF a fháil seiceáil lámhleabhar an SW 19 Social Welfare Rates of Payment chun an méid OPF iníoctha a fháil de réir do acmhainne

source: Step 2: Find your new total gross weekly income
ga: Céim 2: Faigh do ioncam olliomlán seachtainiúil nua

source: Your total weekly income is your new rate of One-Parent Family Payment and your income from work before tax
ga: Sé do ioncam oll-iomlán seachtainiúil nua ná do ráta nua de Íocaíocht Teaghlach Aon-Tuismitheora agus do ioncam ón obair roimh cháin

source: New rate of One-Parent Family Payment (see Step 1 above) €_______
ga: An Ráta nua den Íocaíocht do Theaghlach Aon-Tuismitheora - féach Céim 1 thuas _______

source: Add Gross weekly income from work €_______
ga: Cur leis Ioncam oll-iomlán seachtaine ón obair _______

source: Total Gross weekly income €_______
ga: Iomlán Ioncam Oll-iomlán seachtainiúil _______

source: Step 3: Find your new total net weekly income
ga: Céim 3: Faigh do ioncam olliomlán seachtainiúil nua

source: Your total weekly income is your new rate of One-Parent Family Payment and your income from work after tax
ga: Sé do ioncam oll-iomlán seachtainiúil nua ná do ráta nua de Íocaíocht Teaghlach Aon-Tuismitheora agus do ioncam ón obair roimh cháin

source: From this calculation you will be able to find out if you are financially better off
ga: Ón áirimh seo beidh tú ábalta a fháil amach má tá tú níos fearr as ó thaobh airgead de

source: Gross weekly income €_______
ga: Iomlán Ioncam Oll-iomlán seachtainiúil _______

source: Less Universal Social Charge - see Note 2 below €_______
ga: Bain as Muirear Uilíoch Sóisialach – féach Nóta 2

source: Less PRSI paid each week - see Note 3 below €_______
ga: Bain as ÁSPC a íoctar gach seachtain - féach Nóta 3 _______

source: Less income tax paid each week - see Note 4 below €_______
ga: Bain as Cáin Ioncaim a íoctar gach seachtain - féach Nóta 4 _______

source: Total net income €_______
ga: Iomlán Ioncam Glan _______

source: Remember, you may have to pay child-minding and travel costs out of your net income
ga: Smaoineamh, beidh ort costaisí cúram leanaí agus taistil a íoc as do ioncam glan

source: You will pay a Universal Social Charge (USC) on your gross income from work (if your overall income is above €13,000). Find out more about the Universal Social Charge. You do not pay USC on your OFP payment
ga: Beidh ort a íoc an Muirear Sóisialta Uilíoch (MSU) ar d’ollioncam ón obair (Íocann tú MSU má sháraíonn d’ioncam €13,000 sa bhliain.)

source: You pay PRSI on income from your work only, not on your One-Parent Family Payment
ga: Íocann tú ÁSPC ar ioncam ó do jab amháin, ní ar do Íocaíocht do Theaghlach Aon-Tuismitheora

source: If you earn less than €352 a week you do not pay any PRSI
ga: Má shaothraíonn tú níos lú ná €352 sa tseachtain ní íocann tú ÁSPC

source: You only pay PRSI for the weeks you work
ga: Ní íocann tú ÁSPC ach ar na seachtainí a oibríonn tú

source: You pay income tax (PAYE) on all your income: that is your gross weekly income (see Step 2 above)
ga: Íocann tú cáin ioncaim (ÍMAT) ar do chuid ioncam ar fad: sé sin do Ioncam Oll-Iomlán - féach Céim 2 thuas

source: To calculate how much income tax you pay each week, multiply your gross weekly income by 20% to get the gross amount of income tax payable each week
ga: Chun do Cháin Ioncaim chuile sheachtain a mheas, méadaigh an Ioncam Iomlán fá 20% chun an méid iomlán cáin ioncaim iníoctha sa tseachtain a fháil amach

source: Total gross income by 20% €_______
ga: Ioncam Oll-Iomlán seachtainiúil x 20% _______

source: Less Weekly Tax Credit (see below for calculation)
ga: Bain as Creidmheas Cánach Seachtainiúil (féach thíos luaite chun suim a fheiceáil) €95.19

source: Total income tax paid each week €______
ga: Iomlán Cáin Ioncam a íoctar gach seachtain _______

source: Tax Credit for 2017
ga: Creidmheas Cánach do 2015

source: Add Single Person Child Carer Tax Credit (if eligible): €1,650
ga: An Creidmheas Cánach Cúramóra Linbh do Dhuine Singil €1,650

source: Add PAYE/Employee Tax Credit: €1,650
ga: Creidmheas Cánach ÍMAT/Fostaí €1,650

source: Total Tax Credit: €4,950
ga: Iomlán Creidmheas Cánach €4,950

source: Weekly Tax Credit: €95.19
ga: Roinn ar 52 chun an creidmheas cánach seachtainiúil a fháil de €95.19

source: Other tax free allowances
ga: Liúntais Saor ó Cháin eile

source: If you are a tenant in private-rented accommodation, you may be able to claim some tax relief for rent paid
ga: D'fhéadfadh tú bheith in ann éilimh a dhéanamh ar Fhaoiseamh ó ús morgáiste agus faoiseamh ar shláinte agus faoiseamh ó cháin ar chostaisí leighis

source: If you are a widowed parent you can claim a Widowed Parent Tax Credit
ga: Más tionónta thú i lóistín atá ar chíos phríobháideach, d'fhéadfadh tú bheith ábalta éilimh a dhéanamh ar fhaoiseamh cánach ar chíos atá íoctha

source: You can get more information about tax credits and reliefs
ga: Más tuismitheoir thú atá ina b(h)aintreach is féidir leat éilimh a dhéanamh ar Chreidmheas cánach an Tuismitheoir atá ina B(h)aintreach

source: You should keep your medical card for 3 years from the date you take up employment – check with your local Health Service Executive Area
ga: Is rogha eile én an liúntas cánach seo ó scéimeanna spreagúla fostaíochta eile ar nó an Liúntas um Fhilleadh ar Obair

source: See worksheet on Calculating Rent Supplement to work out how your Rent Supplement will be affected by income from work
ga: Is féidir tuilleadh eolas a fháil faoi chreidmheas cánach agus faoisimh cánach

source: Family Income Supplement (FIS)
ga: Forlíonadh Ioncaim Teaghlaigh (FIS)

source: You can claim FIS if you are working at least 19 hours per week, or 38 hours per fortnight, and your income falls below the income threshold for your family size
ga: Is féidir leis éilimh a dhéanamh ar FIS má tá tú ag obair ar a laghad 19 uair sa tseachtain, nó 38 uair sa gcoicís, agus titfidh do ioncam faoi thairseach ioncaim do mhéid do chlann

source: Family Income Supplement is not taxable and does not affect secondary benefits
ga: Ní féidir cáin a ghearradh ar Fhorlíonadh Ioncaim Teaghlaigh agus ní chuireann sé isteach ar shochair thánaisteacha
